zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_ltdc.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_ltdc.h
  * @author  MCD Application Team
  * @brief   Header file of LTDC HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_HAL_LTDC_H
#define STM32MP13xx_HAL_LTDC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal_def.h"

#include <stdbool.h>
#if defined (LTDC)

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @defgroup LTDC LTDC
  * @brief LTDC HAL module driver
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup LTDC_Exported_Types LTDC Exported Types
  * @{
  */
#define MAX_LAYER  2U

/**
  * @brief  LTDC color structure definition
  */
typedef struct
{
  uint8_t Blue;                    /*!< Configures the blue value.
                                        This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */

  uint8_t Green;                   /*!< Configures the green value.
                                        This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */

  uint8_t Red;                     /*!< Configures the red value.
                                        This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */

  uint8_t Reserved;                /*!< Reserved 0xFF */
} LTDC_ColorTypeDef;

/**
  * @brief  LTDC gamma structure definition
  */
typedef struct
{
  uint8_t Blue;                    /*!< Configures the gamma blue value.
                                        This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */

  uint8_t Green;                   /*!< Configures the gamma green value.
                                        This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */

  uint8_t Red;                     /*!< Configures the gamma red value.
                                        This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF. */

  uint8_t Address;                 /*!< Address of the R,G,B table */
} LTDC_GammaTypeDef;

/**
  * @brief  LTDC external display structure definition
  */
typedef struct
{
  uint32_t YCbCrOrder;           /*!< Chrominance order */

  uint32_t YCbCrSel;             /*!< Selection of the CCIR hard-wired coefficients . */

  uint32_t YCbCrEn;              /*!< Output conversion to YCbCr 422 */

} LTDC_ExtDispTypeDef;

/**
  * @brief  LTDC Planar structure definition
  */
typedef struct
{
  uint32_t OddPixel;                   /*!< Odd pixel first */

  uint32_t CbFirst;                    /*!< Cb component first */

  uint32_t YFirst;                     /*!< Y component first */

  uint32_t YCbCrConversion;            /*!< YCbCr to RGB conversion enable */
} LTDC_PlanarTypeDef;

/**
  * @brief  LTDC Auxiliary structure definition
  */
typedef struct
{
  uint32_t StartAddressBuffer0;        /*!< start address buffer0 */

  uint32_t StartAddressBuffer1;        /*!< start address buffer1 */

  uint32_t FrameBufferPich;            /*!< Frame buffer pitch in bytes */

  uint32_t FrameBufferLineLength;      /*!< Frame buffer line length */

  uint32_t BufferLineNumber;            /*!< buffer line number */
} LTDC_AuxiliaryTypeDef;

/**
  * @brief  LTDC Conversion structure definition
  */
typedef struct
{
  uint32_t CrToGreen;            /*!< Cr to Green */

  uint32_t CbToGreen;            /*!< Cb to Green */

  uint32_t CrToRed;              /*!< CrToRed coefficient */

  uint32_t CbToBlue;             /*!< CbToBlue coefficient */
} LTDC_ConversionTypeDef;

/**
  * @brief  LTDC Init structure definition
  */
typedef struct
{
  uint32_t            HSPolarity;                /*!< configures the horizontal synchronization polarity.
                                                      This parameter can be one value of @ref LTDC_HS_POLARITY */

  uint32_t            VSPolarity;                /*!< configures the vertical synchronization polarity.
                                                      This parameter can be one value of @ref LTDC_VS_POLARITY */

  uint32_t            DEPolarity;                /*!< configures the data enable polarity.
                                                      This parameter can be one of value of @ref LTDC_DE_POLARITY */

  uint32_t            PCPolarity;                /*!< configures the pixel clock polarity.
                                                      This parameter can be one of value of @ref LTDC_PC_POLARITY */

  uint32_t            HorizontalSync;            /*!< configures the number of Horizontal synchronization width.
                                                      This parameter must be a number between Min_Data = 0x000 and
                                                      Max_Data = 0xFFF. */

  uint32_t            VerticalSync;              /*!< configures the number of Vertical synchronization height.
                                                      This parameter must be a number between Min_Data = 0x000 and
                                                      Max_Data = 0x7FF. */

  uint32_t            AccumulatedHBP;            /*!< configures the accumulated horizontal back porch width.
                                                      This parameter must be a number between
                                                      Min_Data = LTDC_HorizontalSync and Max_Data = 0xFFF. */

  uint32_t            AccumulatedVBP;            /*!< configures the accumulated vertical back porch height.
                                                      This parameter must be a number between
                                                      Min_Data = LTDC_VerticalSync and Max_Data = 0x7FF. */

  uint32_t            AccumulatedActiveW;        /*!< configures the accumulated active width.
                                                      This parameter must be a number between
                                                      Min_Data = LTDC_AccumulatedHBP and Max_Data = 0xFFF. */

  uint32_t            AccumulatedActiveH;        /*!< configures the accumulated active height.
                                                      This parameter must be a number between
                                                      Min_Data = LTDC_AccumulatedVBP and Max_Data = 0x7FF. */

  uint32_t            TotalWidth;                /*!< configures the total width.
                                                      This parameter must be a number between
                                                      Min_Data = LTDC_AccumulatedActiveW and Max_Data = 0xFFF. */

  uint32_t            TotalHeigh;                /*!< configures the total height.
                                                      This parameter must be a number between
                                                      Min_Data = LTDC_AccumulatedActiveH and Max_Data = 0x7FF. */

