zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_ltdc.h
  void (* MspInitCallback)(struct __LTDC_HandleTypeDef *hltdc);       /*!< LTDC Msp Init callback      */
  void (* MspDeInitCallback)(struct __LTDC_HandleTypeDef *hltdc);     /*!< LTDC Msp DeInit callback    */

#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */


} LTDC_HandleTypeDef;

#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL LTDC Callback ID enumeration definition
  */
typedef enum
{
  HAL_LTDC_MSPINIT_CB_ID              = 0x00U,    /*!< LTDC MspInit callback ID       */
  HAL_LTDC_MSPDEINIT_CB_ID            = 0x01U,    /*!< LTDC MspDeInit callback ID     */

  HAL_LTDC_LINE_EVENT_CB_ID           = 0x02U,    /*!< LTDC Line Event Callback ID    */
  HAL_LTDC_RELOAD_EVENT_CB_ID         = 0x03U,    /*!< LTDC Reload Callback ID        */
  HAL_LTDC_ERROR_CB_ID                = 0x04U,     /*!< LTDC Error Callback ID         */
  HAL_LTDC_SECURE_LINE_EVENT_CB_ID    = 0x05U,    /*!< LTDC Secure Line Event Callback ID    */
  HAL_LTDC_SECURE_RELOAD_EVENT_CB_ID  = 0x06U,    /*!< LTDC Secure Reload Callback ID        */
  HAL_LTDC_SECURE_ERROR_CB_ID         = 0x07U     /*!< LTDC Secure Error Callback ID         */
} HAL_LTDC_CallbackIDTypeDef;

/**
  * @brief  HAL LTDC Callback pointer definition
  */
typedef  void (*pLTDC_CallbackTypeDef)(LTDC_HandleTypeDef *hltdc);  /*!< pointer to an LTDC callback function */

#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup LTDC_Exported_Constants LTDC Exported Constants
  * @{
  */

/** @defgroup LTDC_Error_Code LTDC Error Code
  * @{
  */
#define HAL_LTDC_ERROR_NONE               0x00000000U   /*!< LTDC No error             */
#define HAL_LTDC_ERROR_TE                 0x00000001U   /*!< LTDC Transfer error       */
#define HAL_LTDC_ERROR_FU                 0x00000002U   /*!< LTDC FIFO Underrun        */
#define HAL_LTDC_ERROR_UK                 0x00000003U   /*!< LTDC FIFO underrun killing  */
#define HAL_LTDC_ERROR_CRC                0x00000004U   /*!< LTDC CRC error              */
#define HAL_LTDC_ERROR_TIMEOUT            0x00000020U   /*!< LTDC Timeout error        */
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
#define  HAL_LTDC_ERROR_INVALID_CALLBACK  0x00000040U   /*!< LTDC Invalid Callback error  */
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup LTDC_Layer LTDC Layer
  * @{
  */
#define LTDC_LAYER_1                      0x00000000U   /*!< LTDC Layer 1 */
#define LTDC_LAYER_2                      0x00000001U   /*!< LTDC Layer 2 */
/**
  * @}
  */

/** @defgroup LTDC_HS_POLARITY LTDC HS POLARITY
  * @{
  */
#define LTDC_HSPOLARITY_AL                0x00000000U   /*!< Horizontal Synchronization is active low. */
#define LTDC_HSPOLARITY_AH                LTDC_GCR_HSPOL            /*!< Horizontal Synchronization is active high. */
/**
  * @}
  */

/** @defgroup LTDC_VS_POLARITY LTDC VS POLARITY
  * @{
  */
#define LTDC_VSPOLARITY_AL                0x00000000U   /*!< Vertical Synchronization is active low. */
#define LTDC_VSPOLARITY_AH                LTDC_GCR_VSPOL            /*!< Vertical Synchronization is active high. */
/**
  * @}
  */

/** @defgroup LTDC_DE_POLARITY LTDC DE POLARITY
  * @{
  */
#define LTDC_DEPOLARITY_AL                0x00000000U   /*!< Data Enable, is active low. */
#define LTDC_DEPOLARITY_AH                LTDC_GCR_DEPOL            /*!< Data Enable, is active high. */
/**
  * @}
  */

/** @defgroup LTDC_PC_POLARITY LTDC PC POLARITY
  * @{
  */
#define LTDC_PCPOLARITY_IPC               0x00000000U   /*!< input pixel clock. */
#define LTDC_PCPOLARITY_IIPC              LTDC_GCR_PCPOL            /*!< inverted input pixel clock. */
/**
  * @}
  */

/** @defgroup LTDC_SYNC LTDC SYNC
  * @{
  */
#define LTDC_HORIZONTALSYNC               (LTDC_SSCR_HSW >> 16U)    /*!< Horizontal synchronization width. */
#define LTDC_VERTICALSYNC                 LTDC_SSCR_VSH             /*!< Vertical synchronization height. */
/**
  * @}
  */

/** @defgroup LTDC_BACK_COLOR LTDC BACK COLOR
  * @{
  */
#define LTDC_COLOR                        0x000000FFU   /*!< Color mask */
/**
  * @}
  */

/** @defgroup LTDC_BlendingFactor1 LTDC Blending Factor1
  * @{
  */
#define LTDC_BLENDING_FACTOR1_CA          0x00000400U   /*!< Blending factor : Cte Alpha */
#define LTDC_BLENDING_FACTOR1_PAxCA       0x00000600U   /*!< Blending factor : Cte Alpha x Pixel Alpha*/
/**
  * @}
  */

/** @defgroup LTDC_BlendingFactor2 LTDC Blending Factor2
  * @{
  */
#define LTDC_BLENDING_FACTOR2_CA          0x00000005U   /*!< Blending factor : Cte Alpha */
#define LTDC_BLENDING_FACTOR2_PAxCA       0x00000007U   /*!< Blending factor : Cte Alpha x Pixel Alpha*/
/**
  * @}
  */

/** @defgroup LTDC_Pixelformat LTDC Pixel format
  * @{
  */
#define LTDC_PIXEL_FORMAT_ARGB8888        0x00000000U   /*!< ARGB8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_ABGR8888        0x00000001U   /*!< ABGR8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_RGBA8888        0x00000002U   /*!< RGBA8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_BGRA8888        0x00000003U   /*!< BGRA8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_RGB565          0x00000004U   /*!< RGB565 LTDC pixel format               */
#define LTDC_PIXEL_FORMAT_BGR565          0x00000005U   /*!< RGB565 LTDC pixel format               */
#define LTDC_PIXEL_FORMAT_RGB888          0x00000006U   /*!< RGB888 LTDC pixel format               */
#define LTDC_PIXEL_FORMAT_ARGB1555        0x00000007U   /*!< ARGB1555 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_ARGB4444        0x00000008U   /*!< ARGB4444 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_L8              0x00000009U   /*!< L8 LTDC pixel format                   */
#define LTDC_PIXEL_FORMAT_AL44            0x0000000AU   /*!< AL44 LTDC pixel format                 */
#define LTDC_PIXEL_FORMAT_AL88            0x0000000BU   /*!< AL88 LTDC pixel format                 */
#define LTDC_PIXEL_FORMAT_UYVY            0x0000000CU   /*!< UYVY Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_VYUY            0x0000000DU   /*!< VYUY Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_YUYV            0x0000000EU   /*!< YUYV Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_YVYU            0x0000000FU   /*!< YVYU Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_NV12            0x00000010U   /*!< NV12 Semi Planar LTDC pixel format     */
#define LTDC_PIXEL_FORMAT_NV21            0x00000011U   /*!< NV21 Semi Planar LTDC pixel format     */
#define LTDC_PIXEL_FORMAT_YUV420          0x00000012U   /*!< YUV420 Full Planar LTDC pixel format   */
#define LTDC_PIXEL_FORMAT_YVU420          0x00000013U   /*!< YVU420 Full Planar LTDC pixel format   */
/**
  * @}
  */

/** @defgroup LTDC_Alpha LTDC Alpha
  * @{
  */
#define LTDC_ALPHA                        LTDC_LxCACR_CONSTA        /*!< LTDC Constant Alpha mask */
/**
  * @}
  */

